<template>
  <div class="home">
    <div class="text">
        你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！
    </div>
    <div class="text1">
        你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！你说啊！
    </div>
  </div>
</template>

<script>

export default {
  name: 'Home',
  components: {
  },
  methods: {
  },
  created () {
    console.log('process.env', process.env)
  }
}
</script>

<style lang="scss" scoped>
.home{
  .text{
    width: 500px;
    line-height: 32px;
    color: $themeColor;
    background-color: $themeBgColor;
    @include textEllipsis;
    margin: 0 auto;
  }
  .text1{
    width: 500px;
    line-height: 32px;
    @include textSomeEllipsis(3);
    margin: 0 auto;
  }
}
</style>
